SELECT count(DISTINCT CNIE) as "Nbr Dossiers", decode(DBMS_LOB.SUBSTR(T.RESPONSE, 4000, 1),'جواباً على طلبكم، نعلمكم أن أنه قد تم تحويل المساعدة المالية باسمكم. ويمكنكم التوجه إلى إحدى وكالات القرب المبينة أسفله لسحبها مصحوبين بكود الأداء الدي توصلتم به على هاتفكم.
 _وافاكاش، الفلاحي كاش، كاش بلوس، انوي موني، ضمان كاش، لناكاش، الشعبي كاش، بريد كاش،بريد بنك، تسهيلات، التوفيق_.','Dossiers consultés pour des mandats émises',
 'نعلمكم أنه لم نتوصل بعد بطلبكم، من الممكن أن يكون قيد المعالجة، وبالتالي، نرجو منكم الانتظار بضعة أيام وإعادة الاتصال بنا','Dossiers consultés non encore traités', 'جواباً على طلبكم، نعلمكم أنه قد تم تحويل المساعدة المالية باسمكم وقد تم استخلاصها','Dossiers consultés pour des mandats payés') as "Libellé"
FROM WHATSAPPLOG.TRANSACTIONS T
WHERE  DBMS_LOB.SUBSTR(T.RESPONSE, 4000, 1) in ('جواباً على طلبكم، نعلمكم أن أنه قد تم تحويل المساعدة المالية باسمكم. ويمكنكم التوجه إلى إحدى وكالات القرب المبينة أسفله لسحبها مصحوبين بكود الأداء الدي توصلتم به على هاتفكم.
 _وافاكاش، الفلاحي كاش، كاش بلوس، انوي موني، ضمان كاش، لناكاش، الشعبي كاش، بريد كاش،بريد بنك، تسهيلات، التوفيق_.',
 'نعلمكم أنه لم نتوصل بعد بطلبكم، من الممكن أن يكون قيد المعالجة، وبالتالي، نرجو منكم الانتظار بضعة أيام وإعادة الاتصال بنا',
 'جواباً على طلبكم، نعلمكم أنه قد تم تحويل المساعدة المالية باسمكم وقد تم استخلاصها'
 )
 AND TO_CHAR(CREATED_AT,'DD/MM/YYYY') in ('06/10/2023','07/10/2023','08/10/2023','09/10/2023','10/10/2023','11/10/2023','12/10/2023','13/10/2023')
 group by DBMS_LOB.SUBSTR(T.RESPONSE, 4000, 1)
